Revit 2027 API
Color.IsValid Property
Identifies if the color represents a valid color, or an uninitialized/invalid value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValid { get; }
Public ReadOnly Property IsValid As Boolean
	Get
public:
property bool IsValid {
	bool get ();
}
member IsValid : bool with get
Property Value
Boolean
See Also
Reference
Color Class
Autodesk.Revit.DB Namespace